WINDOWS REGISTRY / REJESTR WINDOWS:

1. ARTIFACTS:
- HKLM\Software\Microsoft\Windows\CurrentVersion\Run
- HKLM\Software\Microsoft\Windows\CurrentVersion\RunOnce
- HKCU\Software\Microsoft\Windows\CurrentVersion\Run
- HKCU\Software\Microsoft\Windows\CurrentVersion\RunOnce



2. QUERIES (WRITTEN IN KQL, CAN BE TRANSLATED TO OTHER QUERY LANGUAGES):
DeviceRegistryEvents
| where ActionType == "RegistryValueSet" or ActionType == "RegistryKeyCreated"
| where RegistryKey endswith @"\Software\Microsoft\Windows\CurrentVersion\Run" or 
RegistryKey endswith @"\Software\Microsoft\Windows\CurrentVersion\RunOnce"
//filtering_for_often_used_mal_locations
| where RegistryValueData has_any (@"C:\Windows\Temp", @"C:\Users\Public",
@"C:\ProgramData", @"%PUBLIC%", @"%APPDATA%", @"%TEMP%")


DeviceRegistryEvents
| where ActionType == "RegistryValueSet" or ActionType == "RegistryKeyCreated"
| where RegistryKey has @"\Services\"
//filtering_for_often_used_mal_locations
| where RegistryValueData has_any (@"C:\Windows\Temp",@"C:\Users\Public",
@"C:\ProgramData",@"%PUBLIC%",@"%APPDATA%")


let Parameters = dynamic(['http', 'https', 'ftp', @'://', 
'Encoded', 'EncodedCommand', '-e', '-eC', '-enc', "-w"]);
let Executables = dynamic(["cmd", "powershell", "curl", "mshta", "pwsh", 
"cscript", "wscript", "msiexec", "conhost", 'schtasks', 'finger']);
DeviceRegistryEvents
| where ActionType == "RegistryValueSet" or ActionType == "RegistryKeyCreated"
| where RegistryKey has @"\RunMRU" or RegistryKey has @"\TypedPaths"
| where RegistryValueData has_any (Parameters) and RegistryValueData has_any (Executables)


DeviceProcessEvents
| where ProcessVersionInfoOriginalFileName == "reg.exe" or
InitiatingProcessVersionInfoOriginalFileName == "reg.exe"
| where ProcessCommandLine contains " query " or
InitiatingProcessCommandLine contains " query "
| where ProcessCommandLine has @"\Microsoft\Windows Defender\Features" or
InitiatingProcessCommandLine has @"\Microsoft\Windows Defender\Features"


DeviceProcessEvents
| where ProcessVersionInfoOriginalFileName == "reg.exe" or
InitiatingProcessVersionInfoOriginalFileName == "reg.exe"
| where ProcessCommandLine contains " save " or
InitiatingProcessCommandLine contains " save "
| where ProcessCommandLine has_any (@"\system",
@"\sam",@"\security")


DeviceEvents
| where ActionType == "PowerShellCommand"
| where InitiatingProcessCommandLine has_any 
(@"New-ItemProperty",@"Set-ItemProperty")
| where InitiatingProcessCommandLine contains "fDenyTSConnections" or 
InitiatingProcessCommandLine has @"\Control\Terminal Server"


DeviceEvents
| where ActionType == "PowerShellCommand"
| where InitiatingProcessCommandLine has_any 
(@"Get-ItemProperty",@"Get-Item")
| where InitiatingProcessCommandLine has @"\Microsoft\Windows Defender\Features"


DeviceProcessEvents
| where ProcessVersionInfoOriginalFileName == "reg.exe" or
InitiatingProcessVersionInfoOriginalFileName == "reg.exe"
| where ProcessCommandLine contains " add " or
InitiatingProcessCommandLine contains " add "
| where ProcessCommandLine has @"\SecurityProviders\WDigest" or
InitiatingProcessCommandLine has @"\SecurityProviders\WDigest"
| where ProcessCommandLine contains "UseLogonCredential" or
InitiatingProcessCommandLine contains "UseLogonCredential"


DeviceRegistryEvents
| where RegistryKey has @"SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System"
| where RegistryValueName == "EnableLinkedConnections"
| where RegistryValueData == "1"


DeviceProcessEvents
| where ProcessVersionInfoOriginalFileName == "reg.exe" or
InitiatingProcessVersionInfoOriginalFileName == "reg.exe"
| where ProcessCommandLine contains " add " or
InitiatingProcessCommandLine contains " add "
| where ProcessCommandLine has @"Microsoft\Windows\CurrentVersion\Policies\System"
or InitiatingProcessCommandLine has @"Microsoft\Windows\CurrentVersion\Policies\System"
| where ProcessCommandLine has @"/v"
or InitiatingProcessCommandLine has @"/v"
| where ProcessCommandLine contains "EnableLinkedConnections"
or InitiatingProcessCommandLine contains "EnableLinkedConnections"
| where ProcessCommandLine has "1"
or InitiatingProcessCommandLine has "1"


//needs_tuning_in_filtering_section_below_hunting_concept
DeviceRegistryEvents
| where ActionType == "RegistryValueSet" or ActionType == "RegistryKeyCreated"
| where RegistryKey endswith @"\Software\Microsoft\Windows\CurrentVersion\Run" or 
RegistryKey endswith @"\Software\Microsoft\Windows\CurrentVersion\RunOnce"
//filtering_known/legitimate_registry_value_names
| where not (RegistryValueName has_any ("BingWallpaperApp","Jabra Direct",
"Docker Desktop","Opera Stable"))


//needs_tuning_in_filtering_section_below_hunting_concept
DeviceRegistryEvents
| where ActionType == "RegistryValueSet" or ActionType == "RegistryKeyCreated"
| where RegistryKey contains @"\Schedule\TaskCache\Tree"
//filtering_known/legitimate_registry_key_names
| where not (RegistryKey has_any ("OneDrive",@"Office ClickToRun Service Monitor",
@"Windows Defender","Adobe Acrobat Update Task"))



3. LOGGING/MONITORING RECOMMENDATIONS:
- Security Event ID 4657 (A registry value was modified)
- Security Event ID 4688 (A new process has been created)
- Sysmon Event ID 1 (Process creation)
- Sysmon Event ID 12 (RegistryEvent (Object create and delete))
- Sysmon Event ID 13 (RegistryEvent (Value Set))
- Sysmon Event ID 14 (RegistryEvent (Key and Value Rename))
- PowerShell Event ID 4104 (PowerShell Script Block Logging)



4. ADDITIONAL REFERENCES:
- https://attack.mitre.org/techniques/T1012/
- https://www.atomicredteam.io/docs/atomics/T1012
- https://attack.mitre.org/techniques/T1112/
- https://www.atomicredteam.io/docs/atomics/T1112
- https://attack.mitre.org/techniques/T1003/002/
- https://www.atomicredteam.io/docs/atomics/T1003.002
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4657
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4688
- https://www.splunk.com/en_us/blog/security/hunting-for-malicious-powershell-using-script-block-logging.html
- https://persistence-info.github.io/
- https://www.cybertriage.com/blog/windows-registry-forensics-cheat-sheet-2026/
